estadísticas/ejemplo-consulta-desempeno.xml

<?xml version="1.0" encoding="utf-8"?>
<SOAP-ENV:Envelope
        xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
        xmlns:xroad="http://x-road.eu/xsd/xroad.xsd"
        xmlns:om="http://x-road.eu/xsd/op-monitoring.xsd"
        xmlns:id="http://x-road.eu/xsd/identifiers">
    <SOAP-ENV:Header>
        <xroad:client id:objectType="SUBSYSTEM">
            <id:xRoadInstance>sv-test</id:xRoadInstance>
            <id:memberClass>GOB</id:memberClass>
            <id:memberCode>1001</id:memberCode>
            <id:subsystemCode>consulta</id:subsystemCode>
        </xroad:client>
        <xroad:service id:objectType="SERVICE">
            <id:xRoadInstance>sv-test</id:xRoadInstance>
            <id:memberClass>GOB</id:memberClass>
            <id:memberCode>1001</id:memberCode>
            <id:serviceCode>getSecurityServerHealthData</id:serviceCode>
        </xroad:service>
        <xroad:securityServer id:objectType="SERVER">
            <id:xRoadInstance>sv-test</id:xRoadInstance>
            <id:memberClass>GOB</id:memberClass>
            <id:memberCode>1001</id:memberCode>
            <id:serverCode>MIHSV1001-02</id:serverCode>
        </xroad:securityServer>
        <xroad:id>34UXOotFuNM3fO9P9LYtuof0YLhVMvef</xroad:id>
        <xroad:protocolVersion>4.0</xroad:protocolVersion>
    </SOAP-ENV:Header>
 <SOAP-ENV:Body>
    <om:getSecurityServerHealthData>
      <om:filterCriteria>
        <om:client id:objectType="SUBSYSTEM">
          <id:xRoadInstance>sv-test</id:xRoadInstance>
          <id:memberClass>GOB</id:memberClass>
          <id:memberCode>1001</id:memberCode>
          <id:subsystemCode>consulta</id:subsystemCode>
        </om:client>
      </om:filterCriteria>
    </om:getSecurityServerHealthData>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>